#include <iostream>
#include <cmath>

int main(){
	float x,y; std::cin>>x>>y;
	std::cout<<std::isinf(x/y)<<"\n";
	//std::cout<<A%B<<"\n";
}
/*
возвращающие числа{
	-A
	+A

	=
	@= => A+=B == A=A+B
	++ => ++A A++
	-- => --A A--

	+
	-
	*
	/ - деление (при целых нельзя делить на 0)
	% - поиск остатка (только целые)

	&  1100&1001 == 1000
	|  1100|1001 == 1101
	^  1100^1001 == 0101
	<< 1100<<2==110000
	>> 1100>>2==11__
	~U ~1100==11111111111111111111111111110011
}

возвращающие логику{
	<
	>
	<=
	>=
	== - равно
	!= - не равно
	
	||
	&&
	!
}
*/

